In [3]:
# to see all go to panda io in crome
#1 way to create data frame
import pandas as pd
df=pd.read_excel('Book1.xlsx')
df

         day  temp  event  winds
0 2017-02-01    32  sunny      4
1 2017-02-02    34  rainy      5
2 2017-02-03    36  sunny      8
3 2018-02-04    25   snow      2

In [4]:
#2 way
data={'day':['1/2/12','2/2/12','3/2/12'],
   'temp':[23,32,45],
   'winds':[2,5,4,]}
df1=pd.DataFrame(data)
df1

      day  temp  winds
0  1/2/12    23      2
1  2/2/12    32      5
2  3/2/12    45      4

In [5]:
#3 way
data2=[('1/2/12',32,4),
      ('6/2/12',34,7),
      ('5/2/12',45,3)]
df=pd.DataFrame(data2,columns=['day','temp','winds'])
df

      day  temp  winds
0  1/2/12    32      4
1  6/2/12    34      7
2  5/2/12    45      3

In [6]:
#4 way
data3=[{'day':'1/2/12','temp':34,'winds':4},
      {'day':'3/2/12','temp':32,'winds':7},
      {'day':'1/2/12','temp':32,'winds':7},
      {'day':'2/2/12','temp':33,'winds':6},
      {'day':'3/2/12','temp':35,'winds':7},
      {'day':'6/2/12','temp':32,'winds':9},
      {'day':'3/2/12','temp':37,'winds':7},
      {'day':'4/2/12','temp':32,'winds':7},
      {'day':'3/2/12','temp':34,'winds':5},
      {'day':'9/2/12','temp':32,'winds':7}]
df2=pd.DataFrame(data3)
df2

      day  temp  winds
0  1/2/12    34      4
1  3/2/12    32      7
2  1/2/12    32      7
3  2/2/12    33      6
4  3/2/12    35      7
5  6/2/12    32      9
6  3/2/12    37      7
7  4/2/12    32      7
8  3/2/12    34      5
9  9/2/12    32      7

In [31]:
df.head() #print first 5 rows

      day  temp  winds
0  1/2/12    32      4
1  6/2/12    34      7
2  5/2/12    45      3

In [36]:
df.tail(2) #print last 2 rows

      day  temp  winds
1  6/2/12    34      7
2  5/2/12    45      3

In [38]:
df.columns

Index(['day', 'temp', 'winds'], dtype='object')

In [41]:
df.temp
# df['temp']

0    32
1    34
2    45
Name: temp, dtype: int64

In [42]:
type(df['day'])

pandas.core.series.Series

In [44]:
df.temp.max()

45

In [45]:
df.temp.mean()

37.0

In [46]:
df.temp.std()

7.0

In [47]:
df.describe()

       temp     winds
count   3.0  3.000000
mean   37.0  4.666667
std     7.0  2.081666
min    32.0  3.000000
25%    33.0  3.500000
50%    34.0  4.000000
75%    39.5  5.500000
max    45.0  7.000000

In [48]:
df

      day  temp  winds
0  1/2/12    32      4
1  6/2/12    34      7
2  5/2/12    45      3

In [51]:
df=df.set_index('day')

In [52]:
df

        temp  winds
day
1/2/12    32      4
6/2/12    34      7
5/2/12    45      3

In [54]:
df.loc['1/2/12']

temp     32
winds     4
Name: 1/2/12, dtype: int64

In [55]:
df

        temp  winds
day
1/2/12    32      4
6/2/12    34      7
5/2/12    45      3

In [56]:
df.reset_index(inplace=True)

In [57]:
df

      day  temp  winds
0  1/2/12    32      4
1  6/2/12    34      7
2  5/2/12    45      3